### Import libraries

In [1]:
import pandas as pd
import numpy as np
import seaborn
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
import plotly.express as px

Problem Statement

From the dataset given, answer the following questions
1.

In [3]:
#load dataset

car_data = pd.read_csv(r"C:\Users\Administrator\Desktop\Datasets\car_details.csv")
car_data.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [4]:
car_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4340 entries, 0 to 4339
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           4340 non-null   object
 1   year           4340 non-null   int64
 2   selling_price  4340 non-null   int64
 3   km_driven      4340 non-null   int64
 4   fuel           4340 non-null   object
 5   seller_type    4340 non-null   object
 6   transmission   4340 non-null   object
 7   owner          4340 non-null   object
dtypes: int64(3), object(5)
memory usage: 271.4+ KB

In [5]:
car_data.isnull().sum()

name             0
year             0
selling_price    0
km_driven        0
fuel             0
seller_type      0
transmission     0
owner            0
dtype: int64

In [7]:
car_data['transmission'].unique()

array(['Manual', 'Automatic'], dtype=object)

In [41]:
trans = car_data['name'].groupby(car_data['transmission']).count()
trans

transmission
Automatic     448
Manual       3892
Name: name, dtype: int64

In [43]:
# number of diesel and petrol cars
car_fuel = car_data['name'].groupby(car_data['fuel']).count()
car_fuel

fuel
CNG           40
Diesel      2153
Electric       1
LPG           23
Petrol      2123
Name: name, dtype: int64

In [45]:
# number of owner 
car_owner = car_data['name'].groupby(car_data['owner']).count()
car_owner

owner
First Owner             2832
Fourth & Above Owner      81
Second Owner            1106
Test Drive Car            17
Third Owner              304
Name: name, dtype: int64

In [49]:
car_data[['name','selling_price','year']].sort_values(by='selling_price', ascending=False)

                                                   name  selling_price  year
3872           Audi RS7 2015-2019 Sportback Performance        8900000  2016
89    Mercedes-Benz S-Class S 350d Connoisseurs Edition        8150000  2017
3969            Mercedes-Benz GLS 2016-2020 350d 4MATIC        5500000  2016
2258                            BMW X5 xDrive 30d xLine        4950000  2019
612                             BMW X5 xDrive 30d xLine        4950000  2019
...                                                 ...            ...   ...
2849                                 Tata Nano Std BSII          35000  2009
1832                                    Tata Nano LX SE          35000  2012
2444                                      Maruti 800 EX          30000  2004
2495                                  Ford Ikon 1.4 ZXi          22000  2000
2662                              Ford Ikon 1.6 ZXI NXt          20000  2005

[4340 rows x 3 columns]